Revit 2027 API
ParameterTypeId.StairsAttrLandingCarriage Property
 "Landing Carriage Height"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsAttrLandingCarriage { get; }
Public Shared ReadOnly Property StairsAttrLandingCarriage As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsAttrLandingCarriage {
	ForgeTypeId^ get ();
}
static member StairsAttrLandingCarriage : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace